-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2026 年 09 月 11 日 14:47
-- 伺服器版本： 10.11.11-MariaDB
-- PHP 版本： 8.2.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `revon`
--

-- --------------------------------------------------------

--
-- 資料表結構 `custom_tracks`
--

CREATE TABLE `custom_tracks` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL COMMENT '地圖名稱',
  `country` varchar(50) NOT NULL COMMENT '國家',
  `city` varchar(50) NOT NULL COMMENT '縣市',
  `start_lat` double NOT NULL COMMENT '起點緯度',
  `start_lng` double NOT NULL COMMENT '起點經度',
  `end_lat` double NOT NULL COMMENT '終點緯度',
  `end_lng` double NOT NULL COMMENT '終點經度',
  `img` varchar(255) DEFAULT NULL COMMENT '路線圖片',
  `is_hidden` tinyint(1) DEFAULT 0 COMMENT '是否隱藏 (0=顯示, 1=隱藏)',
  `is_vip_only` tinyint(1) DEFAULT 0 COMMENT '是否VIP專屬',
  `vehicle_type` varchar(50) DEFAULT 'car' COMMENT '車輛類型',
  `mid1_lat` double DEFAULT NULL COMMENT '審查點1緯度',
  `mid1_lng` double DEFAULT NULL COMMENT '審查點1經度',
  `mid2_lat` double DEFAULT NULL COMMENT '審查點2緯度',
  `mid2_lng` double DEFAULT NULL COMMENT '審查點2經度',
  `created_at` timestamp NULL DEFAULT current_timestamp() COMMENT '創建時間',
  `creator_id` int(11) NOT NULL COMMENT '創建者用戶ID',
  `creator_email` varchar(100) DEFAULT NULL COMMENT '創建者信箱',
  `creator_account` varchar(100) DEFAULT NULL COMMENT '創建者帳號',
  `status` enum('pending','approved','rejected') NOT NULL DEFAULT 'pending',
  `reject_reason` varchar(255) DEFAULT NULL COMMENT '駁回原因',
  `approved_at` datetime DEFAULT NULL COMMENT '審核通過時間',
  `path` longtext DEFAULT NULL COMMENT '預生成路線 JSON',
  `delete_at` datetime DEFAULT NULL,
  `is_deleted` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='玩家自訂路線';

--
-- 傾印資料表的資料 `custom_tracks`
--

INSERT INTO `custom_tracks` (`id`, `name`, `country`, `city`, `start_lat`, `start_lng`, `end_lat`, `end_lng`, `img`, `is_hidden`, `is_vip_only`, `vehicle_type`, `mid1_lat`, `mid1_lng`, `mid2_lat`, `mid2_lng`, `created_at`, `creator_id`, `creator_email`, `creator_account`, `status`, `reject_reason`, `approved_at`, `path`, `delete_at`, `is_deleted`) VALUES
(1005, '義大-三角', 'Taiwan', 'Kaohsiung', 22.7311492, 120.3994408, 22.7297252, 120.3694168, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-03 12:23:08', 2630, 'a93781922@gmail.com', 'gy_1627', 'approved', NULL, '2026-07-03 20:24:02', NULL, NULL, 0),
(1006, '陽金反', 'Taiwan', 'Taipei', 25.1957689, 121.5929031, 25.1807468, 121.549905, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-03 16:02:44', 762, 'key147258369@gmail.com', 'a0906524379', 'approved', NULL, '2026-07-04 00:04:02', NULL, NULL, 0),
(1007, '觸口-隙頂（下）', 'Taiwan', 'Chiayi', 23.4381032, 120.60753, 23.4270047, 120.6577275, NULL, 0, 0, 'car', 23.4373068, 120.6162877, 23.4172359, 120.6436546, '2026-07-03 17:43:46', 1351, 'toast064978@gmail.com', 'toast064978', 'approved', NULL, '2026-07-04 01:44:02', NULL, NULL, 0),
(1008, '隙頂-觸口（下）', 'Taiwan', 'Chiayi', 23.4270047, 120.6577275, 23.4382017, 120.6076118, NULL, 0, 0, 'car', 23.4233878, 120.6430575, 23.4372721, 120.616338, '2026-07-03 17:48:04', 1351, 'toast064978@gmail.com', 'toast064978', 'approved', NULL, '2026-07-04 01:50:02', NULL, NULL, 0),
(1009, '楠西-觀景台', 'Taiwan', 'Tainan', 23.1865707, 120.4910782, 23.2452715, 120.563418, NULL, 0, 0, 'car', 23.1962126, 120.5122522, 23.2344859, 120.5665324, '2026-07-03 17:56:09', 1351, 'toast064978@gmail.com', 'toast064978', 'approved', NULL, '2026-07-04 01:58:02', NULL, NULL, 0),
(1010, '觀景台-楠西', 'Taiwan', 'Tainan', 23.2452715, 120.563418, 23.1865707, 120.4910782, NULL, 0, 0, 'car', 23.2344859, 120.5665324, 23.1962126, 120.5122522, '2026-07-03 17:59:10', 1351, 'toast064978@gmail.com', 'toast064978', 'approved', NULL, '2026-07-04 02:00:02', NULL, NULL, 0),
(1011, '華山路 下', 'Taiwan', 'Taichung', 24.1602491, 120.5708397, 24.1569144, 120.5484124, NULL, 0, 0, 'car', 24.1607006, 120.558124, 24.157993, 120.5512314, '2026-07-03 18:13:46', 379, 'alan0988642355@gmail.com', 'MinYo', 'approved', NULL, '2026-07-04 02:14:02', NULL, NULL, 0),
(1012, '華山路 上', 'Taiwan', 'Taichung', 24.1569144, 120.5484124, 24.1602491, 120.5708397, NULL, 0, 0, 'car', 24.157993, 120.5512314, 24.1607006, 120.558124, '2026-07-03 18:17:27', 379, 'alan0988642355@gmail.com', 'MinYo', 'approved', NULL, '2026-07-04 02:18:02', NULL, NULL, 0),
(1014, '136太平清涼寺-國姓乾峰橋', 'Taiwan', 'Taichung', 24.1065419, 120.7839289, 24.0273744, 120.8265822, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-04 05:38:36', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-04 13:40:02', NULL, NULL, 0),
(1021, '山海宮（上）', 'Taiwan', 'Kaohsiung', 22.628839, 120.263446, 22.644151, 120.254171, NULL, 0, 0, 'car', 22.633838, 120.261145, 22.637319, 120.256643, '2026-07-04 08:30:56', 837, 'bb200704141202@gmail.com', 'Jason970120', 'approved', NULL, '2026-07-04 16:32:02', NULL, NULL, 0),
(1022, '山海宮（下）', 'Taiwan', 'Kaohsiung', 22.644151, 120.254171, 22.628988, 120.263458, NULL, 0, 0, 'car', 22.637327, 120.256635, 22.633776, 120.261279, '2026-07-04 08:37:48', 837, 'bb200704141202@gmail.com', 'Jason970120', 'approved', NULL, '2026-07-04 16:38:02', NULL, NULL, 0),
(1024, '秀才路', 'Taiwan', 'Taoyuan', 24.8815, 121.128667, 24.841972, 121.100528, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-06 13:09:32', 2692, 'wus0527@gmail.com', 'raion3638', 'approved', NULL, '2026-07-06 21:10:02', NULL, NULL, 0),
(1025, '外木山->海興', 'Taiwan', 'Keelung', 25.1643513, 121.7078975, 25.1603529, 121.7321121, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-08 18:03:29', 142, 'ryanfang2008@gmail.com', 'fyp0125', 'approved', NULL, '2026-07-09 02:04:02', NULL, NULL, 0),
(1028, '136國姓乾峰橋-太平清涼寺', 'Taiwan', 'Taichung', 24.0273819, 120.8266412, 24.1065747, 120.7839603, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-09 01:22:22', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-09 09:24:02', NULL, NULL, 0),
(1030, '進入 外木山', 'Taiwan', 'Keelung', 25.1534, 121.734917, 25.16975, 121.708553, NULL, 0, 0, 'car', 25.164343, 121.72456, 25.164144, 121.708564, '2026-07-11 18:09:31', 1737, 'yutt8660@gmail.com', 'yutt8660', 'approved', NULL, '2026-07-12 02:10:02', NULL, NULL, 0),
(1031, '外木山圓環起點', 'Taiwan', 'Keelung', 25.170376, 121.708537, 25.155309, 121.731677, NULL, 0, 0, 'car', 25.164076, 121.712329, 25.163254, 121.725976, '2026-07-11 18:16:02', 1737, 'yutt8660@gmail.com', 'yutt8660', 'approved', NULL, '2026-07-12 02:18:02', NULL, NULL, 0),
(1032, '九份山下 往不厭亭', 'Taiwan', 'Keelung', 25.107913, 121.812542, 25.089293, 121.848933, NULL, 0, 0, 'car', 25.109803, 121.845206, 25.100781, 121.854402, '2026-07-11 18:29:03', 1737, 'yutt8660@gmail.com', 'yutt8660', 'approved', NULL, '2026-07-12 02:30:02', NULL, NULL, 0),
(1033, '銀河洞-二格', 'Taiwan', 'New Taipei City', 24.9560429, 121.5706147, 24.9569904, 121.6235635, NULL, 0, 0, 'car', 24.9531129, 121.5930319, 24.9569901, 121.6099052, '2026-07-12 06:44:30', 2725, 'lol38188@gmail.com', 'Assd871103', 'approved', NULL, '2026-07-12 14:46:02', NULL, NULL, 0),
(1034, '蝙蝠洞 > 赤崁頂', 'Taiwan', 'Taichung', 24.1069746, 120.7829015, 24.0863067, 120.8180793, NULL, 0, 0, 'car', 24.1024051, 120.8048973, 24.0963964, 120.8102496, '2026-07-12 14:00:27', 379, 'alan0988642355@gmail.com', 'MinYo', 'approved', NULL, '2026-07-12 22:02:02', NULL, NULL, 0),
(1035, '赤崁頂 > 蝙蝠洞', 'Taiwan', 'Taichung', 24.0863067, 120.8180793, 24.1069746, 120.7829015, NULL, 0, 0, 'car', 24.0963964, 120.8102496, 24.1024051, 120.8048973, '2026-07-12 14:20:59', 379, 'alan0988642355@gmail.com', 'MinYo', 'approved', NULL, '2026-07-12 22:22:02', NULL, NULL, 0),
(1036, '國四7-11～谷關紅橋', 'Taiwan', 'Taichung', 24.268824, 120.750199, 24.20004, 121.001387, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-12 14:32:13', 2729, 'sbg602@uahoo.com.tw', 'sbg602', 'approved', NULL, '2026-07-12 22:34:02', NULL, NULL, 0),
(1037, '大肚山下到山上', 'Taiwan', 'Taichung', 24.1574666, 120.5487934, 24.1601754, 120.5706764, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-13 00:57:49', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-13 08:58:02', NULL, NULL, 0),
(1038, '大肚山上到山下', 'Taiwan', 'Taichung', 24.1602558, 120.5706748, 24.1574958, 120.5487344, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-13 00:59:16', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-13 09:00:02', NULL, NULL, 0),
(1040, 'Test', 'Taiwan', 'Test', 24.163466, 120.6254944, 24.1633262, 120.6253958, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-16 11:03:19', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, '2026-07-16 19:04:02', NULL, NULL, 0),
(1041, 'Test 1', 'Taiwan', 'Taichung', 24.1708765, 120.8356421, 24.1573983, 120.8645359, NULL, 0, 0, 'car', 24.1609086, 120.8406277, 24.1562221, 120.8518011, '2026-07-16 13:17:48', 20, 'chiangshuo0816@gmail.com', 'shuo5787', 'approved', NULL, '2026-07-16 21:18:02', NULL, NULL, 0),
(1042, '自訂路線', 'Taiwan', 'Chiayi', 23.5240192, 120.5468356, 23.5772596, 120.5578967, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-17 13:45:15', 1816, 'shakeyoyo@hotmail.com', 'R58_tw', 'approved', NULL, '2026-07-17 21:46:02', NULL, NULL, 0),
(1043, '149下梅山', 'Taiwan', 'Yunlin', 23.597178, 120.5706989, 23.5879813, 120.5656667, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-17 23:50:39', 1816, 'shakeyoyo@hotmail.com', 'R58_tw', 'approved', NULL, '2026-07-18 07:52:02', NULL, NULL, 0),
(1044, '溪埔->大社', 'Taiwan', 'Kaohsiung', 22.718535, 120.44351, 22.72971, 120.369321, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-19 14:24:37', 2756, 'abc87879487abc@gmail.com', 'Yu940906', 'approved', NULL, '2026-07-19 22:26:02', NULL, NULL, 0),
(1045, '義大—> 全家', 'Taiwan', 'Kaohsiung', 22.729608, 120.4068169, 22.7197234, 120.4387838, NULL, 0, 0, 'car', 22.7322108, 120.4173815, 22.7233544, 120.4336313, '2026-07-20 14:06:12', 2538, 'a0906361813@gmail.com', 'Ynn', 'approved', NULL, '2026-07-20 22:08:02', NULL, NULL, 0),
(1047, '天冷白冷圳五號渡槽-國姓樹林', 'Taiwan', 'Taichung', 24.1582134, 120.8693917, 24.0987687, 120.8891852, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-21 11:23:27', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-21 19:24:02', NULL, NULL, 0),
(1048, '國姓樹林-白冷圳五號渡槽', 'Taiwan', 'Taichung', 24.0987535, 120.8892205, 24.1582145, 120.8694279, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-21 11:28:19', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-21 19:30:02', NULL, NULL, 0),
(1049, '北47上坡', 'Taiwan', 'Taichung', 24.97624, 121.65505, 24.95711, 121.63881, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-21 11:36:47', 1905, 'abc0982673006@gmail.com', '19841209', 'approved', NULL, '2026-07-21 19:38:02', NULL, NULL, 0),
(1050, '大同山-上', 'Taiwan', 'New Taipei City', 25.000035, 121.4123486, 25.0026063, 121.4024891, NULL, 0, 0, 'car', 24.9946872, 121.4057859, NULL, NULL, '2026-07-22 16:31:38', 2891, 'chh98139@gmail.com', 'HHGFO', 'approved', NULL, '2026-07-23 00:32:02', NULL, NULL, 0),
(1051, '174', 'Taiwan', 'Tainan', 23.2340271, 120.4739763, 23.2434921, 120.4260577, NULL, 0, 0, 'car', 23.2393858, 120.4687518, 23.2377216, 120.437434, '2026-07-23 13:17:05', 2939, 'dinglai536@gmail.com', 'dinglai536@gmail.com', 'approved', NULL, '2026-07-23 21:18:02', NULL, NULL, 0),
(1052, '里港大橋', 'Taiwan', 'Pingtung', 22.7711756, 120.4494295, 22.7684425, 120.4720077, NULL, 0, 0, 'car', 22.7708337, 120.4527249, NULL, NULL, '2026-07-23 15:36:03', 2841, 'a0960929786@gmail.com', 'Xiaolin1230', 'approved', NULL, '2026-07-23 23:38:02', NULL, NULL, 0),
(1053, '旗楠路0-150', 'Taiwan', 'Kaohsiung', 22.7472093, 120.3457289, 22.7464629, 120.3444747, NULL, 0, 0, 'car', 22.746992, 120.3463561, 22.7465411, 120.3446074, '2026-07-23 15:52:23', 2950, 'chenlun.peng@gmail.com', '0938404864', 'approved', NULL, '2026-07-23 23:54:02', NULL, NULL, 0),
(1056, '舊山路 上', 'Taiwan', 'Taichung', 24.238917, 120.575333, 24.245667, 120.591778, NULL, 0, 0, 'car', 24.243333, 120.582417, NULL, NULL, '2026-07-26 05:31:46', 401, 'jerry26398246@gmail.com', 'ac0973862320', 'approved', NULL, '2026-07-26 13:32:02', NULL, NULL, 0),
(1057, '舊山路 下坡', 'Taiwan', 'Taichung', 24.24575, 120.591639, 24.239028, 120.575194, NULL, 0, 0, 'car', 24.245333, 120.584806, NULL, NULL, '2026-07-26 05:38:05', 401, 'jerry26398246@gmail.com', 'ac0973862320', 'approved', NULL, '2026-07-26 13:40:02', NULL, NULL, 0),
(1059, '東安路0-150m', 'Taiwan', 'Kaohsiung', 22.8596153, 120.287408, 22.8582862, 120.2877543, NULL, 0, 0, 'car', NULL, NULL, NULL, NULL, '2026-07-26 08:55:32', 3039, 'qkskdidki222255636566@gmail.com', 'Alex970116', 'approved', NULL, '2026-07-26 16:56:02', NULL, NULL, 0),
(1061, '乳姑山', 'Taiwan', 'Taoyuan', 24.860049, 121.192661, 24.89596, 121.154659, NULL, 0, 0, 'car', 24.865719, 121.186617, 24.88531, 121.161856, '2026-07-27 04:00:37', 1441, 'niceplay60123@gmail.com', 'Joshon71', 'approved', NULL, '2026-07-27 12:02:02', NULL, NULL, 0),
(1062, '三角公園0-150', 'Taiwan', 'Kaohsiung', 22.729721, 120.368985, 22.729986, 120.365034, NULL, 0, 0, 'car', 22.729871, 120.367947, 22.730015, 120.366255, '2026-07-27 16:43:35', 2629, 'liny24394@gmail.com', 'cy_1087', 'approved', NULL, '2026-07-28 00:44:02', NULL, NULL, 0),
(1063, '大鶯路', 'Taiwan', 'New Taipei City', 24.93454, 121.325891, 24.892875, 121.279615, NULL, 0, 0, 'car', 24.927829, 121.314315, 24.919402, 121.302808, '2026-07-28 04:17:21', 3160, 'a0968272453@gmail.com', 'en_12_10', 'approved', NULL, '2026-07-28 12:18:02', NULL, NULL, 0),
(1065, '148員林上坡', 'Taiwan', 'Changhua', 23.964569, 120.601647, 23.976332, 120.619672, NULL, 0, 0, 'car', 23.970525, 120.607963, 23.973778, 120.611384, '2026-07-29 02:35:04', 2979, '420weeddoooog@gmail.com', 'CL-8957', 'approved', NULL, '2026-07-29 10:36:02', NULL, NULL, 0),
(1069, '海倫咖啡-銀河隊', 'Taiwan', 'New Taipei City', 24.952294, 121.645415, 24.954558, 121.568768, NULL, 0, 0, 'car', 24.957851, 121.622668, 24.950678, 121.579477, '2026-07-29 09:33:47', 3246, 'sky1225c@gmail.com', 'fonfron123', 'approved', NULL, '2026-07-29 17:34:02', NULL, NULL, 0),
(1070, '北新莊', 'Taiwan', 'New Taipei City', 25.180717, 121.453361, 25.252149, 121.502062, NULL, 0, 0, 'car', 25.185195, 121.48187, 25.226109, 121.515405, '2026-07-29 09:34:55', 375, 'huang940408@gmail.com', 'Huang', 'approved', NULL, '2026-07-29 17:36:02', NULL, NULL, 0),
(1076, '大鶯路', 'Taiwan', 'Taoyuan', 24.893459, 121.279972, 24.925019, 121.310933, NULL, 0, 0, 'car', 24.923462, 121.308097, 24.921769, 121.305688, '2026-07-29 14:29:29', 3299, 'ches.tyc.edu.tw@gmail.com', 'ches.tyc.edu.tw@gmail.com', 'approved', NULL, '2026-07-29 22:30:02', NULL, NULL, 0),
(1077, '石坑路', 'Taiwan', 'Kaohsiung', 22.979664, 120.482331, 22.953878, 120.476579, NULL, 0, 0, 'car', 22.975274, 120.482752, 22.964662, 120.481783, '2026-07-29 15:03:19', 3362, 's0403182.kh@go.edu.tw', 'shenggoudan6@gmail.com', 'approved', NULL, '2026-07-29 23:04:02', NULL, NULL, 0),
(1078, '明志後山', 'Taiwan', 'New Taipei City', 25.040325, 121.422011, 25.047157, 121.41581, NULL, 0, 0, 'car', 25.035577, 121.41541, 25.04308, 121.415405, '2026-07-29 16:53:24', 3422, '5454hhyy@gmail.com', 'mickey', 'approved', NULL, '2026-07-30 00:54:02', NULL, NULL, 0),
(1079, '請勿使用 試用中', 'Taiwan', 'Changhua', 23.903174, 120.373571, 23.914782, 120.379635, NULL, 0, 0, 'car', 23.905347, 120.374775, 23.908033, 120.376134, '2026-07-29 18:35:50', 3433, 'zzhijia12@gmail.com', 'zzxv', 'approved', NULL, '2026-07-30 02:36:02', NULL, NULL, 0),
(1082, '古坑華山149（上）', 'Taiwan', 'Yunlin', 23.595805, 120.598781, 23.599433, 120.620809, NULL, 0, 0, 'car', 23.599666, 120.603496, 23.598932, 120.61506, '2026-07-29 21:13:41', 3460, 'S0903919808@gmail.com', '0903919808', 'approved', NULL, '2026-07-30 05:14:02', NULL, NULL, 0),
(1084, '上山139觀景台 請小心', 'Taiwan', 'Changhua', 24.020389, 120.571254, 24.017306, 120.600123, NULL, 0, 0, 'car', 24.021417, 120.576551, 24.020454, 120.58488, '2026-07-30 08:09:12', 3433, 'zzhijia12@gmail.com', 'zzxv', 'approved', NULL, '2026-07-30 16:10:02', NULL, NULL, 0),
(1085, '台72', 'Taiwan', 'Miaoli', 24.575361, 120.846641, 24.600628, 120.817089, NULL, 0, 0, 'car', 24.582962, 120.846661, 24.596117, 120.828346, '2026-07-30 08:32:56', 3343, 'jerryabcd960117@gmail.com', 'EN', 'approved', NULL, '2026-07-30 16:34:02', NULL, NULL, 0),
(1086, '金六結直線盃', 'Taiwan', 'Yilan', 24.751875, 121.731735, 24.750674, 121.725077, NULL, 0, 0, 'car', 24.750832, 121.72887, 24.75087, 121.726867, '2026-07-30 09:52:17', 3225, 'b0958266001@gmail.com', '7cein', 'approved', NULL, '2026-07-30 17:54:02', NULL, NULL, 0),
(1087, '七乙0～14k', 'Taiwan', 'New Taipei City', 24.909883, 121.366004, 24.832472, 121.330609, NULL, 0, 0, 'car', 24.856514, 121.359309, 24.847818, 121.334494, '2026-07-30 13:45:46', 3522, 'a0979805356a.z@gmail.com', '853016', 'approved', NULL, '2026-07-30 21:46:02', NULL, NULL, 0),
(1089, '南崗產業道路', 'Taiwan', 'Taichung', 24.177821, 120.571075, 24.190987, 120.549755, NULL, 0, 0, 'car', 24.180637, 120.564456, 24.18701, 120.557035, '2026-07-31 04:22:33', 3587, 'a49309953@gmail.com', 'yan124__', 'approved', NULL, '2026-07-31 12:24:02', NULL, NULL, 0),
(1090, '南昌巷（仁武-大樹）', 'Taiwan', 'Kaohsiung', 22.696283, 120.375615, 22.673647, 120.407555, NULL, 0, 0, 'car', 22.688015, 120.383353, 22.681152, 120.397985, '2026-07-31 05:39:02', 2351, 'eugene89010411@gmail.com', 'eugene89010411', 'approved', NULL, '2026-07-31 13:40:02', NULL, NULL, 0),
(1092, '柑園直線加速賽', 'Taiwan', 'New Taipei City', 24.962339, 121.405748, 24.968588, 121.404793, NULL, 0, 0, 'car', 24.964023, 121.40499, 24.966544, 121.404728, '2026-07-31 11:17:57', 3352, 'aaa0985480220@gmail.com', 'KUO_0901', 'approved', NULL, '2026-07-31 19:18:02', NULL, NULL, 0),
(1094, '明志後山下山杯', 'Taiwan', 'New Taipei City', 25.048311, 121.415649, 25.037816, 121.417815, NULL, 0, 0, 'car', 25.043753, 121.416372, 25.040315, 121.415596, '2026-08-01 02:35:43', 1596, 'benson20001220@gmail.com', 'Mugen444', 'approved', NULL, '2026-08-01 10:36:02', NULL, NULL, 0),
(1096, '台三線', 'Taiwan', 'Chiayi', 23.524267, 120.547184, 23.575461, 120.555253, NULL, 0, 0, 'car', 23.547286, 120.548397, 23.560501, 120.557079, '2026-08-01 10:25:51', 2882, 'hanklee1124@gmail.com', 'Hanklee', 'approved', NULL, '2026-08-01 18:26:02', NULL, NULL, 0),
(1097, '南深路', 'Taiwan', 'Taipei', 25.034358, 121.619434, 25.009732, 121.620124, NULL, 0, 0, 'car', 25.028062, 121.622407, 25.019988, 121.622075, '2026-08-01 13:54:29', 3766, 'Caibojun621@gmail.com', 'Caibojun621', 'approved', NULL, '2026-08-01 21:56:02', NULL, NULL, 0),
(1098, '南深路 反', 'Taiwan', 'Taipei', 25.009587, 121.620081, 25.034403, 121.619499, NULL, 0, 0, 'car', 25.019677, 121.622288, 25.028065, 121.622533, '2026-08-01 14:01:51', 3766, 'Caibojun621@gmail.com', 'Caibojun621', 'approved', NULL, '2026-08-01 22:02:02', NULL, NULL, 0),
(1101, '五指山', 'Taiwan', 'Taipei', 25.128072, 121.621831, 25.109445, 121.637324, NULL, 0, 0, 'car', 25.123884, 121.627018, 25.118218, 121.625448, '2026-08-01 19:47:22', 3812, 'chesterhsu0830@gmail.com', 'Xccc0830', 'approved', NULL, '2026-08-02 03:48:02', NULL, NULL, 0),
(1102, '（二輪）海倫-銀河', 'Taiwan', 'New Taipei City', 24.951899, 121.645921, 24.952865, 121.567155, NULL, 0, 0, 'car', 24.957394, 121.623473, 24.952702, 121.586861, '2026-08-01 20:18:31', 2455, '70903carry@gmail.com', 'Cy520892', 'approved', NULL, '2026-08-02 04:20:02', NULL, NULL, 0),
(1104, '三角-義大下（上山段', 'Taiwan', 'Kaohsiung', 22.730215, 120.370286, 22.73226, 120.39828, NULL, 0, 0, 'car', 22.738133, 120.383838, 22.736409, 120.391917, '2026-08-02 01:29:24', 3193, 'ki8ki8ki8ooo@gmail.com', 'Cl317', 'approved', NULL, '2026-08-02 09:30:02', NULL, NULL, 0),
(1105, '員林148-139觀景台', 'Taiwan', 'Changhua', 23.964562, 120.601701, 24.017558, 120.600176, NULL, 0, 0, 'car', 23.973791, 120.609748, 23.993546, 120.611915, '2026-08-02 06:00:54', 2979, '420weeddoooog@gmail.com', 'CL-8957', 'approved', NULL, '2026-08-02 14:02:02', NULL, NULL, 0),
(1106, '大武山-上山', 'Taiwan', 'Pingtung', 22.59204, 120.6335, 22.574811, 120.649709, NULL, 0, 0, 'car', 22.587994, 120.641304, 22.583029, 120.647793, '2026-08-02 07:34:49', 2854, 'zjehrjhdrurur@gmail.com', '6767Wei', 'approved', NULL, '2026-08-02 15:36:02', NULL, NULL, 0),
(1107, '台21 以前APP計時點', 'Taiwan', 'Taichung', 24.153618, 120.869879, 24.126611, 120.877682, NULL, 0, 0, 'car', 24.150445, 120.876991, 24.135827, 120.876036, '2026-08-02 08:17:28', 2357, 'a243196327@yahoo.com.tw', '0978315071', 'approved', NULL, '2026-08-02 16:18:02', NULL, NULL, 0),
(1109, '研究院四段', 'Taiwan', 'Taipei', 25.012088, 121.578993, 25.033545, 121.610952, NULL, 0, 0, 'car', 25.018656, 121.592621, 25.025527, 121.602719, '2026-08-02 15:35:21', 3947, 'ricky950518@gmail.com', 'ricky950518', 'approved', NULL, '2026-08-02 23:36:02', NULL, NULL, 0),
(1110, '北76下', 'Taiwan', 'New Taipei City', 25.067787, 121.379937, 25.06278, 121.416173, NULL, 0, 0, 'car', 25.062792, 121.395157, 25.057374, 121.406706, '2026-08-02 16:42:04', 3083, 'supervip66666@gmail.com', 'zengleo', 'approved', NULL, '2026-08-03 00:44:02', NULL, NULL, 0),
(1111, '北76上', 'Taiwan', 'New Taipei City', 25.06304, 121.416761, 25.067367, 121.380574, NULL, 0, 0, 'car', 25.05629, 121.404684, 25.063896, 121.393899, '2026-08-02 16:56:17', 3083, 'supervip66666@gmail.com', 'zengleo', 'approved', NULL, '2026-08-03 00:58:02', NULL, NULL, 0),
(1112, '新東橋', 'Taiwan', 'Miaoli', 24.540528, 120.842092, 24.535176, 120.915978, NULL, 0, 0, 'car', 24.535121, 120.863054, 24.533875, 120.893173, '2026-08-02 18:39:32', 4062, 'hziyou11@gmail.com', 'ziyou', 'approved', NULL, '2026-08-03 02:40:02', NULL, NULL, 0),
(1113, '台86線', 'Taiwan', 'Tainan', 22.935927, 120.176246, 22.963504, 120.3101, NULL, 0, 0, 'car', 22.929445, 120.220893, 22.942478, 120.25007, '2026-08-03 04:03:34', 4185, 'tungfu1120@gmail.com', 'tungfu1120', 'approved', NULL, '2026-08-03 12:04:02', NULL, NULL, 0),
(1114, '崎溜北極殿-中寮一路', 'Taiwan', 'Kaohsiung', 22.795487, 120.375519, 22.848533, 120.465736, NULL, 0, 0, 'car', 22.811325, 120.398469, 22.817832, 120.423136, '2026-08-03 07:26:59', 2907, 'louis45159@gmail.com', 'louis45159', 'approved', NULL, '2026-08-03 15:28:02', NULL, NULL, 0),
(1115, '安康路三段', 'Taiwan', 'New Taipei City', 24.933819, 121.457975, 24.939843, 121.47109, NULL, 0, 0, 'car', 24.936797, 121.46152, 24.93946, 121.465177, '2026-08-03 07:47:21', 4263, 'a0909511801@gmail.con', 'Zate9668', 'approved', NULL, '2026-08-03 15:48:02', NULL, NULL, 0),
(1116, '安康路三段 往三峽', 'Taiwan', 'New Taipei City', 24.93996, 121.471048, 24.934166, 121.458526, NULL, 0, 0, 'car', 24.939526, 121.465226, 24.93594, 121.460462, '2026-08-03 07:49:55', 4263, 'a0909511801@gmail.con', 'Zate9668', 'approved', NULL, '2026-08-03 15:50:02', NULL, NULL, 0),
(1117, '工專路直線杯（李耀宇家門口）', 'Taiwan', 'New Taipei City', 25.039226, 121.424403, 25.040561, 121.423082, NULL, 0, 0, 'car', 25.039471, 121.424098, 25.039703, 121.423667, '2026-08-03 10:20:38', 3722, 'lanjiaomei783@gmail.com', 'lanjiaomei783@gmail.com', 'approved', NULL, '2026-08-03 18:22:02', NULL, NULL, 0),
(1118, '烏來全段（上山）', 'Taiwan', 'New Taipei City', 24.946944, 121.546072, 24.872925, 121.547463, NULL, 0, 0, 'car', 24.922356, 121.549311, 24.88757, 121.551952, '2026-08-03 11:07:08', 1472, 'wangting1275@gmail.com', 'timmy1011', 'approved', NULL, '2026-08-03 19:08:02', NULL, NULL, 0),
(1119, '中寮139', 'Taiwan', 'Nantou', 23.876623, 120.772291, 23.831544, 120.777342, NULL, 0, 0, 'car', 23.860695, 120.76811, 23.844325, 120.766091, '2026-08-03 12:36:49', 4321, 'york519519@gmail.com', 'hanni', 'approved', NULL, '2026-08-03 20:38:02', NULL, NULL, 0),
(1120, '烏來下山', 'Taiwan', 'New Taipei City', 24.868539, 121.549187, 24.946882, 121.54598, NULL, 0, 0, 'car', 24.879517, 121.542326, 24.908236, 121.552734, '2026-08-03 15:53:03', 3648, 'Nailao1219@gmail.com', 'cygnusx_1219', 'approved', NULL, '2026-08-03 23:54:02', NULL, NULL, 0),
(1121, '171', 'Taiwan', 'Tainan', 22.992343, 120.438375, 23.010875, 120.41705, NULL, 0, 0, 'car', 23.002442, 120.434423, 23.007891, 120.42757, '2026-08-03 16:08:08', 3801, 'focus.rs.gt@gmail.com', 'He bfardo', 'approved', NULL, '2026-08-04 00:10:02', NULL, NULL, 0),
(1122, '牛稠埔-田寮分隊', 'Taiwan', 'Kaohsiung', 22.834364, 120.372403, 22.824753, 120.405758, NULL, 0, 0, 'car', 22.833933, 120.38215, 22.825554, 120.395901, '2026-08-03 16:17:45', 2854, 'zjehrjhdrurur@gmail.com', '6767Wei', 'approved', NULL, '2026-08-04 00:18:02', NULL, NULL, 0),
(1123, '（二輪）烏來下行', 'Taiwan', 'New Taipei City', 24.86888, 121.548842, 24.94714, 121.546028, NULL, 0, 0, 'car', 24.90421, 121.554035, 24.929991, 121.543825, '2026-08-03 20:04:41', 2455, '70903carry@gmail.com', 'Cy520892', 'approved', NULL, '2026-08-04 04:06:02', NULL, NULL, 0),
(1124, '虎頭山', 'Taiwan', 'Taoyuan', 25.003738, 121.324219, 25.045394, 121.352137, NULL, 0, 0, 'car', 25.008249, 121.326466, 25.029846, 121.330572, '2026-08-04 05:42:02', 3927, 'shengyu0226@gmail.com', 'Simon0826', 'approved', NULL, NULL, NULL, NULL, 0),
(1125, '寶山-北埔正', 'Taiwan', 'Hsinchu', 24.748301, 121.019659, 24.705637, 121.047837, NULL, 0, 0, 'car', 24.732623, 121.028024, 24.719041, 121.037636, '2026-08-04 09:04:34', 4421, 'achiang1121@gmail.com', 'Achiang21', 'approved', NULL, NULL, NULL, NULL, 0),
(1126, '711大坑門市', 'Taiwan', 'Taichung', 24.176769, 120.727769, 24.182792, 120.925099, NULL, 0, 0, 'car', 24.192485, 120.808591, 24.174592, 120.883292, '2026-08-04 10:08:10', 4428, 'cs940819@gmail.com', 'cs940819', 'approved', NULL, NULL, NULL, NULL, 0),
(1127, '萬壽路下坡', 'Taiwan', 'New Taipei City', 25.001297, 121.366157, 25.014371, 121.395447, NULL, 0, 0, 'car', 25.009002, 121.375116, 25.014331, 121.394438, '2026-08-04 14:43:54', 3722, 'lanjiaomei783@gmail.com', 'lanjiaomei783@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1128, '小琉球山豬溝（以天台冰方向下）', 'Taiwan', 'Pingtung', 22.33223, 120.359251, 22.339896, 120.364027, NULL, 0, 0, 'car', 22.33522, 120.361689, 22.338128, 120.361785, '2026-08-04 14:44:55', 4450, 'yanjun.huang1@icloud.com', 'yanjun.huang1@icloud.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1129, '山豬溝（下）', 'Taiwan', 'Pingtung', 22.34031, 120.364089, 22.33212, 120.359336, NULL, 0, 0, 'car', 22.338484, 120.361987, 22.336781, 120.361396, '2026-08-04 14:48:09', 4450, 'yanjun.huang1@icloud.com', 'yanjun.huang1@icloud.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1131, '測試', 'Taiwan', 'Pingtung', 22.579036, 120.605028, 22.583829, 120.608384, NULL, 0, 0, 'car', 22.582528, 120.607434, 22.583829, 120.608384, '2026-08-04 15:57:03', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, NULL, NULL, NULL, 0),
(1132, '測試試試', 'Taiwan', 'Hsinchu City', 23.966576, 120.89687, 23.051903, 120.560099, NULL, 0, 0, 'car', 24.358704, 121.480605, 23.487973, 121.086103, '2026-08-04 16:19:31', 19, 'qaz911028@gmail.com', 'Revon', 'rejected', NULL, NULL, NULL, NULL, 0),
(1133, '北新莊（往淡水', 'Taiwan', 'New Taipei City', 25.250655, 121.500885, 25.187356, 121.484379, NULL, 0, 0, 'car', 25.223241, 121.513962, 25.204893, 121.502205, '2026-08-04 17:40:27', 4475, 'chienwillim@gmail.com', 'Chienyu', 'approved', NULL, NULL, NULL, NULL, 0),
(1134, '觀音山>萊爾富（往五股下山', 'Taiwan', 'New Taipei City', 25.128735, 121.418473, 25.109403, 121.43067, NULL, 0, 0, 'car', 25.122992, 121.42493, 25.115115, 121.43148, '2026-08-05 03:22:31', 3965, 'aa2676233587@gmail.com', 'aa26762335', 'approved', NULL, NULL, NULL, NULL, 0),
(1135, '美人洞到山豬溝', 'Taiwan', 'Pingtung', 22.35406, 120.381006, 22.332138, 120.359137, NULL, 0, 0, 'car', 22.354811, 120.380327, 22.354786, 120.376522, '2026-08-05 09:41:20', 4450, 'yanjun.huang1@icloud.com', 'yanjun.huang1@icloud.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1136, '台六線（公館往大湖', 'Taiwan', 'Miaoli', 24.466642, 120.835417, 24.461576, 120.877304, NULL, 0, 0, 'car', 24.465718, 120.84879, 24.467381, 120.87412, '2026-08-05 13:46:41', 4692, 'c745998@gmail.com', 'Yoyo-0312', 'approved', NULL, NULL, NULL, NULL, 0),
(1137, '台六線（大湖往公館', 'Taiwan', 'Miaoli', 24.460092, 120.877066, 24.466612, 120.835409, NULL, 0, 0, 'car', 24.467164, 120.873084, 24.466451, 120.847137, '2026-08-05 13:52:19', 4692, 'c745998@gmail.com', 'Yoyo-0312', 'approved', NULL, NULL, NULL, NULL, 0),
(1138, '陽金', 'Taiwan', 'Taipei', 25.152286, 121.54572, 25.179613, 121.562381, NULL, 0, 0, 'car', 25.166995, 121.540861, 25.177667, 121.557081, '2026-08-05 14:25:58', 2219, 'aaronchen0118@gmail.com', 'aa34668371', 'approved', NULL, NULL, NULL, NULL, 0),
(1139, '台74線（洲際段直線）', 'Taiwan', 'Taichung', 24.200537, 120.660083, 24.201062, 120.70255, NULL, 0, 0, 'car', 24.200785, 120.679902, 24.200908, 120.68903, '2026-08-05 15:14:23', 2111, 'yanbaiyiq@gmail.com', 'Chs822', 'approved', NULL, NULL, NULL, NULL, 0),
(1140, '台9蘇花', 'Taiwan', 'Hualien', 24.280973, 121.746218, 24.170449, 121.654437, NULL, 0, 0, 'car', 24.230281, 121.700382, 24.208712, 121.670765, '2026-08-05 15:16:36', 4603, 'love_890812@yahoo.com.tw', 'love890812', 'approved', NULL, NULL, NULL, NULL, 0),
(1141, '南方澳觀景台', 'Taiwan', 'New Taipei City', 24.596156, 121.854033, 24.576989, 121.865847, NULL, 0, 0, 'car', 24.591729, 121.857966, 24.585028, 121.860724, '2026-08-05 15:27:08', 4742, 'max960818@icloud.com', 'Ppap', 'approved', NULL, NULL, NULL, NULL, 0),
(1142, '烘爐地下坡', 'Taiwan', 'New Taipei City', 24.972655, 121.498502, 24.981236, 121.502016, NULL, 0, 0, 'car', 24.972939, 121.49877, 24.975837, 121.501309, '2026-08-05 17:19:45', 4132, 'fh7.andy@gmail.com', 'Land', 'approved', NULL, NULL, NULL, NULL, 0),
(1143, '楊金下制高點到馬槽', 'Taiwan', 'Taipei', 25.180428, 121.54957, 25.180833, 121.560889, NULL, 0, 0, 'car', 25.180344, 121.553122, 25.183568, 121.55799, '2026-08-05 17:42:59', 3854, 'erichongww@gmail.com', 'zxc38931056', 'approved', NULL, NULL, NULL, NULL, 0),
(1144, '（二輪）南深-往南港下行', 'Taiwan', 'Taipei', 25.0173, 121.623149, 25.035118, 121.62045, NULL, 0, 0, 'car', 25.022316, 121.623395, 25.028596, 121.622422, '2026-08-05 17:59:36', 2455, '70903carry@gmail.com', 'Cy520892', 'approved', NULL, NULL, NULL, NULL, 0),
(1145, '（二輪）南深-往深坑下行', 'Taiwan', 'Taipei', 25.017212, 121.623096, 25.006583, 121.622415, NULL, 0, 0, 'car', 25.015556, 121.624749, 25.009445, 121.619523, '2026-08-05 18:00:57', 2455, '70903carry@gmail.com', 'Cy520892', 'approved', NULL, NULL, NULL, NULL, 0),
(1146, '台七乙', 'Taiwan', 'Taoyuan', 24.832182, 121.330642, 24.909647, 121.366049, NULL, 0, 0, 'car', 24.848574, 121.334386, 24.850195, 121.343402, '2026-08-05 19:13:35', 4777, 'linyuanxing727@gmail.com', 'mmb_5168', 'approved', NULL, NULL, NULL, NULL, 0),
(1147, '海倫 - 坪林', 'Taiwan', 'New Taipei City', 24.949336, 121.648833, 24.936059, 121.703314, NULL, 0, 0, 'car', 24.947298, 121.658545, 24.938272, 121.67717, '2026-08-06 01:08:21', 935, 'gobby0805@gmail.com', 'gobby0805', 'approved', NULL, NULL, NULL, NULL, 0),
(1148, '竹林上', 'Taiwan', 'Taichung', 24.238571, 120.572081, 24.249369, 120.597049, NULL, 0, 0, 'car', 24.243291, 120.582273, 24.245229, 120.591364, '2026-08-06 01:30:49', 4363, 'yqin5669@gmail.com', 'wcy', 'approved', NULL, NULL, NULL, NULL, 0),
(1149, '竹林下', 'Taiwan', 'Taichung', 24.24933, 120.597036, 24.238569, 120.572126, NULL, 0, 0, 'car', 24.247953, 120.588491, 24.241493, 120.581597, '2026-08-06 01:32:47', 4363, 'yqin5669@gmail.com', 'wcy', 'approved', NULL, NULL, NULL, NULL, 0),
(1150, '大雅坡 上', 'Taiwan', 'Taichung', 24.2389715, 120.575208, 24.245948, 120.591919, NULL, 0, 0, 'car', 24.243749, 120.584217, 24.248181, 120.589063, '2026-08-06 10:24:51', 379, 'alan0988642355@gmail.com', 'MinYo', 'approved', NULL, NULL, NULL, NULL, 0),
(1151, '大雅坡 下', 'Taiwan', 'Taichung', 24.245991, 120.591837, 24.2389715, 120.575208, NULL, 0, 0, 'car', 24.248181, 120.589063, 24.243749, 120.584217, '2026-08-06 10:29:29', 379, 'alan0988642355@gmail.com', 'MinYo', 'approved', NULL, NULL, NULL, NULL, 0),
(1152, '公老坪．上', 'Taiwan', 'Taichung', 24.255231, 120.745338, 24.263283, 120.753369, NULL, 0, 0, 'car', 24.259581, 120.755939, 24.260529, 120.751321, '2026-08-06 11:23:24', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1153, '公老坪．下', 'Taiwan', 'Taichung', 24.263252, 120.753347, 24.254513, 120.748786, NULL, 0, 0, 'car', 24.260528, 120.751288, 24.259737, 120.75589, '2026-08-06 11:27:01', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1154, '國道三號大直線．大甲＞苑里（無測速）', 'Taiwan', 'Taichung', 24.352752, 120.659826, 24.37239, 120.664641, NULL, 0, 0, 'car', 24.360533, 120.66226, 24.364493, 120.663085, '2026-08-06 11:33:40', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1155, '國道四號大直線．清水＞后里（無測速）', 'Taiwan', 'Taichung', 24.306582, 120.622162, 24.287547, 120.655901, NULL, 0, 0, 'car', 24.305714, 120.6256, 24.298357, 120.640751, '2026-08-06 11:40:21', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1156, '高美大直線．風車大道＞海角明珠', 'Taiwan', 'Taichung', 24.305627, 120.542606, 24.312214, 120.529953, NULL, 0, 0, 'car', 24.30771, 120.538618, 24.310183, 120.533891, '2026-08-06 11:46:54', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1157, '高美大直線．海角明珠＞風車大道', 'Taiwan', 'Taichung', 24.312129, 120.529909, 24.305293, 120.543054, NULL, 0, 0, 'car', 24.31077, 120.532639, 24.307696, 120.538524, '2026-08-06 11:55:22', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1158, '大甲文曲路巷道．大安＞大甲', 'Taiwan', 'Taichung', 24.334326, 120.597776, 24.340811, 120.617686, NULL, 0, 0, 'car', 24.337844, 120.604298, 24.341091, 120.611679, '2026-08-06 13:17:51', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1159, '大甲文曲路巷道．大甲＞大安', 'Taiwan', 'Taichung', 24.340829, 120.617617, 24.334324, 120.597819, NULL, 0, 0, 'car', 24.341085, 120.611539, 24.337703, 120.603557, '2026-08-06 13:22:08', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1161, '大甲溪橋大直線．大甲＞清水', 'Taiwan', 'Taichung', 24.326096, 120.607981, 24.312937, 120.603937, NULL, 0, 0, 'car', 24.322862, 120.606999, 24.317604, 120.605421, '2026-08-07 07:55:04', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1162, '甲后路四段．下坡', 'Taiwan', 'Taichung', 24.333324, 120.651744, 24.338178, 120.643613, NULL, 0, 0, 'car', 24.336672, 120.648202, 24.337251, 120.644931, '2026-08-07 08:00:53', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1163, '甲后路四段．上坡', 'Taiwan', 'Taichung', 24.338128, 120.643546, 24.333367, 120.651623, NULL, 0, 0, 'car', 24.33729, 120.645063, 24.337382, 120.646744, '2026-08-07 08:03:47', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1164, '寶山1號水庫', 'Taiwan', 'Hsinchu', 24.759618, 121.051902, 24.73961, 121.027347, NULL, 0, 0, 'car', 24.749966, 121.044242, 24.743182, 121.038163, '2026-08-07 08:12:54', 4576, 'aaron20041015@gmail.com', 'aaron20041015', 'approved', NULL, NULL, NULL, NULL, 0),
(1165, '竹東1', 'Taiwan', 'Hsinchu', 24.766094, 121.05721, 24.747603, 121.080033, NULL, 0, 0, 'car', 24.760612, 121.061593, 24.756561, 121.069877, '2026-08-07 08:21:04', 4576, 'aaron20041015@gmail.com', 'aaron20041015', 'approved', NULL, NULL, NULL, NULL, 0),
(1166, '竹東2', 'Taiwan', 'Hsinchu', 24.74764, 121.080028, 24.771217, 121.051188, NULL, 0, 0, 'car', 24.754775, 121.071636, 24.76047, 121.061788, '2026-08-07 08:22:40', 4576, 'aaron20041015@gmail.com', 'aaron20041015', 'approved', NULL, NULL, NULL, NULL, 0),
(1167, '七乙1公里', 'Taiwan', 'New Taipei City', 24.856514, 121.359319, 24.852119, 121.352617, NULL, 0, 0, 'car', 24.854171, 121.357086, 24.853581, 121.354635, '2026-08-07 09:52:15', 3522, 'a0979805356a.z@gmail.com', '853016', 'approved', NULL, NULL, NULL, NULL, 0),
(1168, '老玩家的10k', 'Taiwan', 'New Taipei City', 24.856534, 121.359326, 24.853895, 121.344312, NULL, 0, 0, 'car', 24.849994, 121.351223, 24.851547, 121.347072, '2026-08-07 09:56:54', 3522, 'a0979805356a.z@gmail.com', '853016', 'approved', NULL, NULL, NULL, NULL, 0),
(1171, '牛山', 'Taiwan', 'Hualien', 23.778607, 121.560539, 23.731655, 121.55844, NULL, 0, 0, 'car', 23.767412, 121.560986, 23.749723, 121.556691, '2026-08-07 12:19:13', 3855, 'wen19993321@gmail.com', 'Wenjiexun', 'approved', NULL, NULL, NULL, NULL, 0),
(1172, '明志後山(直線起點)', 'Taiwan', 'New Taipei City', 25.039381, 121.419164, 25.047742, 121.416031, NULL, 0, 0, 'car', 25.039469, 121.416733, 25.042745, 121.416625, '2026-08-07 13:46:05', 3728, 'ta0970129660@gmail.com', 'lin08282000', 'approved', NULL, NULL, NULL, NULL, 0),
(1173, '北宜上山銀河洞-二格公園', 'Taiwan', 'Taipei', 24.956392, 121.570639, 24.957852, 121.622643, NULL, 0, 0, 'car', 24.957144, 121.609771, 24.961443, 121.614766, '2026-08-07 13:55:32', 2725, 'lol38188@gmail.com', 'Assd871103', 'approved', NULL, NULL, NULL, NULL, 0),
(1174, '谷關', 'Taiwan', 'Taichung', 24.161826, 120.860418, 24.200575, 121.001423, NULL, 0, 0, 'car', 24.18353, 120.911913, 24.173337, 120.971337, '2026-08-07 14:50:18', 4948, 'Skin0411@icloud.com', '超級58', 'approved', NULL, NULL, NULL, NULL, 0),
(1177, '海風產業道路-上', 'Taiwan', 'Taichung', 24.304987, 120.611309, 24.303401, 120.611977, NULL, 0, 0, 'car', 24.304607, 120.612105, 24.304143, 120.612099, '2026-08-07 17:17:29', 4649, 's93t86501@gmail.com', 's93t86501', 'approved', NULL, NULL, NULL, NULL, 0),
(1178, '外埔六分路小路．后里＞外埔', 'Taiwan', 'Taichung', 24.329586, 120.712287, 24.334035, 120.688692, NULL, 0, 0, 'car', 24.33348, 120.709835, 24.334862, 120.700186, '2026-08-07 17:21:51', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1179, '外埔六分路小路．外埔＞后里', 'Taiwan', 'Taichung', 24.334002, 120.688796, 24.329655, 120.712298, NULL, 0, 0, 'car', 24.334835, 120.70023, 24.334165, 120.707253, '2026-08-07 17:24:09', 4804, 'banana223030@gmail.com', 'banana2230', 'approved', NULL, NULL, NULL, NULL, 0),
(1180, '136', 'Taiwan', 'Taichung', 24.109073, 120.78032, 24.086061, 120.818185, NULL, 0, 0, 'car', 24.103056, 120.80148, 24.093711, 120.81429, '2026-08-08 04:09:13', 829, 'linjunjia941115180@gmail.com', 'xuny2010', 'approved', NULL, NULL, NULL, NULL, 0),
(1181, '128休閒跑', 'Taiwan', 'Miaoli', 24.500384, 120.737085, 24.501182, 120.774439, NULL, 0, 0, 'car', 24.497589, 120.749219, 24.501851, 120.754731, '2026-08-08 17:26:39', 5040, 'a0908048869@gmail.com', 'Nick0618', 'approved', NULL, NULL, NULL, NULL, 0),
(1183, '149華山下坡（二輪）', 'Taiwan', 'Yunlin', 23.59903, 120.614253, 23.597465, 120.602093, NULL, 0, 0, 'car', 23.599697, 120.611839, 23.600615, 120.602532, '2026-08-09 17:16:30', 4795, 'xinchan.1229@gmail.com', 'xinchan.____', 'approved', NULL, NULL, NULL, NULL, 0),
(1185, '觀音山國家公園', 'Taiwan', 'New Taipei City', 25.105104, 121.403304, 25.12478, 121.423168, NULL, 0, 0, 'car', 25.114464, 121.403496, 25.128065, 121.419085, '2026-08-09 18:28:11', 5306, 'aa367hhco@gmail.com', 'aa367hhco', 'approved', NULL, NULL, NULL, NULL, 0),
(1186, '北宜上山（銀河洞-328）', 'Taiwan', 'Taipei', 24.956363, 121.570235, 24.941878, 121.673773, NULL, 0, 0, 'car', 24.956343, 121.624056, 24.951856, 121.646192, '2026-08-09 21:12:02', 5372, 'karxyz06@gmail.com', 'Cb__r3', 'approved', NULL, NULL, NULL, NULL, 0),
(1187, '大科路（林高後門）', 'Taiwan', 'New Taipei City', 25.064753, 121.41995, 25.072054, 121.38185, NULL, 0, 0, 'car', 25.05619, 121.404394, 25.066584, 121.386006, '2026-08-10 02:15:50', 5438, 'yujunlin0831@gmail.com', 'jinzl7044', 'approved', NULL, NULL, NULL, NULL, 0),
(1188, '古坑華山仙地迴轉點', 'Taiwan', 'Yunlin', 23.598963, 120.614479, 23.599186, 120.620918, NULL, 0, 0, 'car', 23.598064, 120.61692, 23.597936, 120.618991, '2026-08-10 02:44:42', 5015, 'a0908811856@gmail.com', 'a0986816856@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1189, '74', 'Taiwan', 'Taichung', 24.201412, 120.701974, 24.201221, 120.701913, NULL, 0, 0, 'car', 24.192442, 120.641677, 24.117328, 120.614371, '2026-08-10 05:39:49', 5489, 'alan20030705@gmail.com', 'op193724865', 'approved', NULL, NULL, NULL, NULL, 0),
(1190, '關西-羅馬', 'Taiwan', 'Hsinchu City', 24.77009, 121.191828, 24.76894, 121.216085, NULL, 0, 0, 'car', 24.776384, 121.199667, 24.773064, 121.210654, '2026-08-10 05:45:39', 5487, 'hsuu0310@gmail.com', 'hsuu0310@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1191, '大科路（麗園）', 'Taiwan', 'New Taipei City', 25.062742, 121.416036, 25.067779, 121.379273, NULL, 0, 0, 'car', 25.056072, 121.403793, 25.066604, 121.385535, '2026-08-10 06:45:18', 5438, 'yujunlin0831@gmail.com', 'jinzl7044', 'approved', NULL, NULL, NULL, NULL, 0),
(1192, '泰林路三段（上山', 'Taiwan', 'New Taipei City', 25.064688, 121.420237, 25.077349, 121.397849, NULL, 0, 0, 'car', 25.068729, 121.412437, 25.072868, 121.4039, '2026-08-10 06:48:13', 5438, 'yujunlin0831@gmail.com', 'jinzl7044', 'approved', NULL, NULL, NULL, NULL, 0),
(1193, '泰林路三段（下山', 'Taiwan', 'New Taipei City', 25.077292, 121.397986, 25.065216, 121.418978, NULL, 0, 0, 'car', 25.072736, 121.404258, 25.069222, 121.412126, '2026-08-10 06:50:49', 5438, 'yujunlin0831@gmail.com', 'jinzl7044', 'approved', NULL, NULL, NULL, NULL, 0),
(1194, '大科路（林高後門下山', 'Taiwan', 'New Taipei City', 25.071604, 121.381763, 25.064679, 121.41972, NULL, 0, 0, 'car', 25.057351, 121.400171, 25.057972, 121.407926, '2026-08-10 06:54:05', 5438, 'yujunlin0831@gmail.com', 'jinzl7044', 'approved', NULL, NULL, NULL, NULL, 0),
(1196, '楠西-觀景臺（車涯）', 'Taiwan', 'Tainan', 23.191793, 120.497621, 23.239929, 120.571656, NULL, 0, 0, 'car', 23.214243, 120.539971, 23.230258, 120.555676, '2026-08-10 11:05:08', 5404, 'cooolpan@gmail.com', 'cooolpan', 'approved', NULL, NULL, NULL, NULL, 0),
(1197, '環島24耐', 'Taiwan', 'Taipei', 25.180653, 121.420212, 25.180879, 121.420644, NULL, 0, 0, 'car', 21.903772, 120.853972, 25.119879, 121.928546, '2026-08-10 11:17:15', 5566, 'jeffv109@gmail.com', '38894782', 'approved', NULL, NULL, NULL, NULL, 0),
(1198, '觀景臺-楠西（車涯）', 'Taiwan', 'Tainan', 23.239916, 120.571639, 23.191769, 120.497619, NULL, 0, 0, 'car', 23.231867, 120.55704, 23.214358, 120.540135, '2026-08-10 12:25:23', 5404, 'cooolpan@gmail.com', 'cooolpan', 'approved', NULL, NULL, NULL, NULL, 0),
(1199, '谷關下', 'Taiwan', 'Taichung', 24.203189, 121.006267, 24.16226, 120.859566, NULL, 0, 0, 'car', 24.166176, 120.951233, 24.166871, 120.899826, '2026-08-10 14:08:53', 5528, 'aa0938900069@gmail.com', 'Jun0087', 'approved', NULL, NULL, NULL, NULL, 0),
(1200, '汐平-停車場到三坑亭', 'Taiwan', 'New Taipei City', 25.05195, 121.703575, 25.035073, 121.730567, NULL, 0, 0, 'car', 25.057562, 121.704085, 25.042944, 121.721443, '2026-08-10 17:10:37', 2572, 'cnmsb386@gmail.com', 'Hasen1010', 'approved', NULL, NULL, NULL, NULL, 0),
(1202, '烏來全段（上）', 'Taiwan', 'New Taipei City', 24.947559, 121.546082, 24.868901, 121.548714, NULL, 0, 0, 'car', 24.922648, 121.549382, 24.913085, 121.54867, '2026-08-11 04:18:33', 5181, 'as09df876@gmail.com', 'as09df876', 'approved', NULL, NULL, NULL, NULL, 0),
(1203, '烏來（下）', 'Taiwan', 'New Taipei City', 24.8689, 121.548769, 24.947812, 121.546068, NULL, 0, 0, 'car', 24.91307, 121.548656, 24.922631, 121.549399, '2026-08-11 04:20:55', 5181, 'as09df876@gmail.com', 'as09df876', 'approved', NULL, NULL, NULL, NULL, 0),
(1204, '(南迴)壽卡>土地公廟', 'Taiwan', 'Pingtung', 22.245692, 120.83554, 22.268687, 120.853984, NULL, 0, 0, 'car', 22.263232, 120.849883, 22.269066, 120.851115, '2026-08-11 05:35:13', 2618, '3eejunyi@gmail.com', 'w8739524e', 'approved', NULL, NULL, NULL, NULL, 0),
(1205, '玩玩', 'Taiwan', 'Taoyuan', 24.98238, 121.271136, 24.932168, 121.281701, NULL, 0, 0, 'car', 24.960936, 121.279114, 24.960266, 121.279212, '2026-08-11 06:00:25', 5658, 'xli9745@gmail.com', 'Li', 'approved', NULL, NULL, NULL, NULL, 0),
(1206, '田寮分隊-牛稠埔', 'Taiwan', 'Kaohsiung', 22.824806, 120.405704, 22.833908, 120.382012, NULL, 0, 0, 'car', 22.824986, 120.398907, 22.832489, 120.389757, '2026-08-11 06:53:13', 2854, 'zjehrjhdrurur@gmail.com', '6767Wei', 'approved', NULL, NULL, NULL, NULL, 0),
(1207, '台三 北行', 'Taiwan', 'Miaoli', 24.537116, 120.918288, 24.604215, 120.958775, NULL, 0, 0, 'car', 24.558903, 120.928956, 24.57939, 120.94009, '2026-08-11 07:14:52', 4841, 'adaitouch@gmail.com', 'adaitouch', 'approved', NULL, NULL, NULL, NULL, 0),
(1208, '香菇 獅潭', 'Taiwan', 'Miaoli', 24.535014, 120.862415, 24.535725, 120.91779, NULL, 0, 0, 'car', 24.533547, 120.900908, 24.539804, 120.882686, '2026-08-11 07:44:40', 5190, 'i525433@gmail.com', 'i5678404', 'approved', NULL, NULL, NULL, NULL, 0),
(1210, '和平新另外', 'Taiwan', 'Taichung', 24.241706, 120.631659, 24.244333, 120.635337, NULL, 0, 0, 'car', 24.242573, 120.632937, 24.242997, 120.63368, '2026-08-11 14:16:45', 5675, 'k0976118535@gmail.com', 'k0976118535@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1212, '東橋', 'Taiwan', 'Tainan', 23.022591, 120.235213, 23.025015, 120.233312, NULL, 0, 0, 'car', 23.020348, 120.232396, 23.023501, 120.230346, '2026-08-11 19:34:44', 5075, 'aa0978130267@gmail.com', 'Jms0903', 'approved', NULL, NULL, NULL, NULL, 0),
(1213, '日光->集來', 'Taiwan', 'Kaohsiung', 22.980779, 120.552483, 23.019798, 120.568118, NULL, 0, 0, 'car', 22.990826, 120.566836, 23.002053, 120.573555, '2026-08-12 06:59:30', 2864, 's0965007294@gmail.com', 'eddie', 'approved', NULL, NULL, NULL, NULL, 0),
(1214, '全家➡️義大', 'Taiwan', 'Kaohsiung', 22.718587, 120.443687, 22.729735, 120.402852, NULL, 0, 0, 'car', 22.725309, 120.428077, 22.731853, 120.415031, '2026-08-12 10:36:41', 2904, 'x8154285@gmail.com', 'a19870728', 'approved', NULL, NULL, NULL, NULL, 0),
(1215, '麟洛賽車場', 'Taiwan', 'Pingtung', 22.651865, 120.544192, 22.653813, 120.535411, NULL, 0, 0, 'car', 22.652038, 120.541293, 22.653261, 120.53815, '2026-08-12 13:17:56', 5752, 'a0900266239@gmail.com', 'xzu1', 'approved', NULL, NULL, NULL, NULL, 0),
(1216, '二格-銀河洞', 'Taiwan', 'New Taipei City', 24.957915, 121.622915, 24.9554, 121.569619, NULL, 0, 0, 'car', 24.961037, 121.614742, 24.956258, 121.60243, '2026-08-12 15:07:03', 5611, 'lihb5797@gmail.com', 'lihb5797@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1217, '崁頂郵局 力社7-11', 'Taiwan', 'Pingtung', 22.514481, 120.513531, 22.540545, 120.513405, NULL, 0, 0, 'car', 22.52077, 120.512378, 22.538731, 120.509018, '2026-08-12 15:19:30', 5745, 'a0906155125@gmail.com', 'a0906155125@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1218, '二寮 上', 'Taiwan', 'Tainan', 23.024642, 120.349644, 23.00903, 120.415403, NULL, 0, 0, 'car', 23.010111, 120.385595, 23.009212, 120.407203, '2026-08-13 12:21:22', 5111, 'qazgglopdd@gmail.com', 'Danielttyyuuii', 'approved', NULL, NULL, NULL, NULL, 0),
(1219, '二寮下', 'Taiwan', 'Tainan', 23.00913, 120.414761, 23.024749, 120.34962, NULL, 0, 0, 'car', 23.008336, 120.398866, 23.010181, 120.385642, '2026-08-13 12:24:50', 5111, 'qazgglopdd@gmail.com', 'Danielttyyuuii', 'approved', NULL, NULL, NULL, NULL, 0),
(1220, '台9仁水隧道至崇德', 'Taiwan', 'Hualien', 24.278512, 121.744792, 24.169742, 121.654227, NULL, 0, 0, 'car', 24.220437, 121.689185, 24.195486, 121.662194, '2026-08-13 14:33:37', 4603, 'love_890812@yahoo.com.tw', 'love890812', 'approved', NULL, NULL, NULL, NULL, 0),
(1221, '溫家直線賽', 'Taiwan', 'Hsinchu', 24.834556, 121.006013, 24.832026, 121.004113, NULL, 0, 0, 'car', 24.833294, 121.005068, 24.832818, 121.004692, '2026-08-13 15:13:19', 5808, 'chanlinliao0401@gmail.com', 'chanlin', 'approved', NULL, NULL, NULL, NULL, 0),
(1222, '台中華山', 'Taiwan', 'Chiayi', 24.16019, 120.570344, 24.157752, 120.551292, NULL, 0, 0, 'car', 24.161073, 120.55764, 24.159828, 120.552142, '2026-08-14 07:16:42', 5906, 's0911002953@gmail.com', 's0911002953@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1223, '甲仙-六龜（舊測時點）', 'Taiwan', 'Kaohsiung', 23.083436, 120.591013, 23.070963, 120.670252, NULL, 0, 0, 'car', 23.063023, 120.6216, 23.072387, 120.643383, '2026-08-14 08:54:28', 5404, 'cooolpan@gmail.com', 'cooolpan', 'approved', NULL, NULL, NULL, NULL, 0),
(1224, 'Linluo monkey', 'Taiwan', 'Pingtung', 22.6638, 120.552136, 22.665346, 120.547804, NULL, 0, 0, 'car', 22.66423, 120.550438, 22.664453, 120.548642, '2026-08-14 11:11:20', 5752, 'a0900266239@gmail.com', 'xzu1', 'approved', NULL, NULL, NULL, NULL, 0),
(1225, '萬大橋直線 崙頂到大寮', 'Taiwan', 'Pingtung', 22.589635, 120.455484, 22.593363, 120.439194, NULL, 0, 0, 'car', 22.590973, 120.451397, 22.592519, 120.445518, '2026-08-14 11:22:34', 2618, '3eejunyi@gmail.com', 'w8739524e', 'approved', NULL, NULL, NULL, NULL, 0),
(1226, '北新莊', 'Taiwan', 'Taipei', 25.185273, 121.482579, 25.251164, 121.501203, NULL, 0, 0, 'car', 25.217948, 121.510472, 25.223853, 121.515071, '2026-08-14 11:43:06', 5882, 'Mark920829@gmail.com', 'Mark920829', 'approved', NULL, NULL, NULL, NULL, 0),
(1227, '山腳龍新路', 'Taiwan', 'Taichung', 24.185275, 120.57338, 24.196597, 120.546876, NULL, 0, 0, 'car', 24.18898, 120.57087, 24.195711, 120.553977, '2026-08-14 15:27:47', 3958, 'za931005@gmail.com', 'a38486825', 'approved', NULL, NULL, NULL, NULL, 0),
(1228, '148 下坡', 'Taiwan', 'Changhua', 23.976357, 120.620009, 23.970764, 120.643472, NULL, 0, 0, 'car', 23.976514, 120.631749, 23.974284, 120.639543, '2026-08-14 16:43:01', 4682, 'a0928446919@gmail.com', 'Yunming58', 'approved', NULL, NULL, NULL, NULL, 0),
(1229, '197', 'Taiwan', 'Taitung', 22.787048, 121.158524, 22.811279, 121.138742, NULL, 0, 0, 'car', 22.81953, 121.148821, 22.850937, 121.150071, '2026-08-15 03:01:34', 3118, 's060203ryan45@gmail.com', 'Wei45', 'approved', NULL, NULL, NULL, NULL, 0),
(1230, '台中環道（順時針）74-國三-74', 'Taiwan', 'Taichung', 24.093703, 120.68736, 24.093703, 120.68736, NULL, 0, 0, 'car', 24.188628, 120.639067, 24.082936, 120.620243, '2026-08-15 10:42:43', 4670, 'dd.czl1221@gmail.com', 'Dannychen', 'approved', NULL, NULL, NULL, NULL, 0),
(1231, '虎頭山回程', 'Taiwan', 'Taoyuan', 25.045855, 121.35596, 25.020521, 121.324669, NULL, 0, 0, 'car', 25.045841, 121.354579, 25.032484, 121.331735, '2026-08-15 12:55:05', 5217, 'jk0973692014@gmail.com', 'Zhong0922', 'approved', NULL, NULL, NULL, NULL, 0),
(1232, '鯉魚潭', 'Taiwan', 'Hualien', 23.915905, 121.505865, 23.880832, 121.513698, NULL, 0, 0, 'car', 23.900656, 121.509438, 23.892093, 121.508553, '2026-08-15 20:43:35', 6015, 'yizhiqiu318@gmail.com', 'yizhiqiu318@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1233, '環東南下', 'Taiwan', 'New Taipei City', 25.056612, 121.622494, 25.051327, 121.570779, NULL, 0, 0, 'car', 25.059133, 121.594426, 25.057339, 121.581412, '2026-08-16 00:14:14', 2095, 'lcw030459@icloud.com', 'Lcw030459', 'approved', NULL, NULL, NULL, NULL, 0),
(1234, '梅山-竹崎', 'Taiwan', 'Chiayi', 23.567308, 120.556898, 23.526979, 120.545555, NULL, 0, 0, 'car', 23.556734, 120.552202, 23.549896, 120.548053, '2026-08-17 00:33:54', 5041, '0729c6363@gmail.com', '7_vvaxy', 'approved', NULL, NULL, NULL, NULL, 0),
(1235, '南昌巷（大樹-仁武）', 'Taiwan', 'Kaohsiung', 22.673752, 120.407453, 22.696185, 120.375635, NULL, 0, 0, 'car', 22.679556, 120.399871, 22.687347, 120.387235, '2026-08-17 08:10:41', 2351, 'eugene89010411@gmail.com', 'eugene89010411', 'approved', NULL, NULL, NULL, NULL, 0),
(1236, '174上山', 'Taiwan', 'Tainan', 23.237393, 120.372616, 23.234331, 120.473545, NULL, 0, 0, 'car', 23.236625, 120.416089, 23.237566, 120.451339, '2026-08-18 08:42:37', 5148, 'huangaquan27@gmail.com', 'William10', 'approved', NULL, NULL, NULL, NULL, 0),
(1237, '水波里活動中心到地母宮入口', 'Taiwan', 'Miaoli', 24.434684, 120.691147, 24.432709, 120.718378, NULL, 0, 0, 'car', 24.430881, 120.704301, 24.428356, 120.715921, '2026-08-19 03:00:17', 6163, 'a0901170312@gmail.com', 'a0901170312@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1238, '燕巢中寮山', 'Taiwan', 'Kaohsiung', 22.812604, 120.409497, 22.81777, 120.423055, NULL, 0, 0, 'car', 22.81258, 120.409674, 22.817621, 120.422884, '2026-08-19 07:15:25', 2293, 'evan0907600678@gmail.com', 'apple6260079', 'approved', NULL, NULL, NULL, NULL, 0),
(1239, '獅潭-苗栗', 'Taiwan', 'Miaoli', 24.535789, 120.918113, 24.540922, 120.841474, NULL, 0, 0, 'car', 24.535266, 120.859404, 24.540793, 120.849877, '2026-08-19 20:20:53', 6188, 'youhaoz527@gmail.com', 'youhaoz527@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1240, '大湖全家----獅潭仙草', 'Taiwan', 'Miaoli', 24.456463, 120.879485, 24.480249, 120.895356, NULL, 0, 0, 'car', 24.45976, 120.884141, 24.470289, 120.886695, '2026-08-20 04:39:25', 5190, 'i525433@gmail.com', 'i5678404', 'approved', NULL, NULL, NULL, NULL, 0),
(1241, '獅潭仙草   大湖', 'Taiwan', 'Miaoli', 24.535212, 120.918369, 24.461531, 120.885766, NULL, 0, 0, 'car', 24.523227, 120.912318, 24.505225, 120.907966, '2026-08-20 04:42:26', 5190, 'i525433@gmail.com', 'i5678404', 'approved', NULL, NULL, NULL, NULL, 0),
(1242, '大湖  獅潭', 'Taiwan', 'Miaoli', 24.46026, 120.885723, 24.533147, 120.917856, NULL, 0, 0, 'car', 24.477492, 120.890819, 24.490478, 120.900038, '2026-08-20 04:44:21', 5190, 'i525433@gmail.com', 'i5678404', 'approved', NULL, NULL, NULL, NULL, 0);
INSERT INTO `custom_tracks` (`id`, `name`, `country`, `city`, `start_lat`, `start_lng`, `end_lat`, `end_lng`, `img`, `is_hidden`, `is_vip_only`, `vehicle_type`, `mid1_lat`, `mid1_lng`, `mid2_lat`, `mid2_lng`, `created_at`, `creator_id`, `creator_email`, `creator_account`, `status`, `reject_reason`, `approved_at`, `path`, `delete_at`, `is_deleted`) VALUES
(1243, '北埔到五指山', 'Taiwan', 'Hsinchu', 24.699979, 121.054737, 24.642318, 121.089738, NULL, 0, 0, 'car', 24.662994, 121.072429, 24.649479, 121.092163, '2026-08-20 11:36:14', 6213, 'aivan102485@gmail.com', 'aivan102485', 'approved', NULL, NULL, NULL, NULL, 0),
(1244, '148下員林', 'Taiwan', 'Changhua', 23.976344, 120.619728, 23.964567, 120.601698, NULL, 0, 0, 'car', 23.975201, 120.614988, 23.973852, 120.609813, '2026-08-20 16:45:01', 2979, '420weeddoooog@gmail.com', 'CL-8957', 'approved', NULL, NULL, NULL, NULL, 0),
(1245, '古坑華山仙地-迴轉點下山', 'Taiwan', 'Yunlin', 23.599016, 120.620895, 23.598913, 120.614148, NULL, 0, 0, 'car', 23.598356, 120.619612, 23.598016, 120.617186, '2026-08-20 18:26:42', 5015, 'a0908811856@gmail.com', 'a0986816856@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1246, '139縣道(36.5K-6K)下山段', 'Taiwan', 'Nantou', 23.917561, 120.637595, 24.051593, 120.583179, NULL, 0, 0, 'car', 23.947472, 120.635761, 24.018402, 120.599753, '2026-08-21 04:04:15', 6125, 'xhul921227@gmail.com', 'zhul921227', 'approved', NULL, NULL, NULL, NULL, 0),
(1247, '朝陽後山·上', 'Taiwan', 'Taichung', 24.068869, 120.716176, 24.062707, 120.725013, NULL, 0, 0, 'car', 24.065638, 120.718966, 24.06408, 120.721549, '2026-08-21 12:07:31', 4978, 'sam51050505@gmail.com', 'QAZ23307113', 'approved', NULL, NULL, NULL, NULL, 0),
(1248, '朝陽後山-下', 'Taiwan', 'Taichung', 24.062633, 120.725133, 24.066388, 120.716499, NULL, 0, 0, 'car', 24.064061, 120.721526, 24.065591, 120.719053, '2026-08-21 12:11:34', 4978, 'sam51050505@gmail.com', 'QAZ23307113', 'approved', NULL, NULL, NULL, NULL, 0),
(1249, '高雄國道環狀線', 'Taiwan', 'Kaohsiung', 22.678456, 120.319163, 22.678733, 120.319854, NULL, 0, 0, 'car', 22.573423, 120.52827, 22.786363, 120.426915, '2026-08-21 12:54:40', 6244, 'ben0928759723@gmail.com', '原廠B', 'approved', NULL, NULL, NULL, NULL, 0),
(1250, '楊金竹馬段', 'Taiwan', 'Taipei', 25.167512, 121.540279, 25.178044, 121.563508, NULL, 0, 0, 'car', 25.179668, 121.544611, 25.179433, 121.556722, '2026-08-23 10:18:12', 4653, 'zhengdehuang999@gmail.com', 'JAPFOX', 'approved', NULL, NULL, NULL, NULL, 0),
(1251, '台9丁（東澳-南澳）', 'Taiwan', 'Yilan', 24.516189, 121.82956, 24.469083, 121.807541, NULL, 0, 0, 'car', 24.491703, 121.831498, 24.475326, 121.817379, '2026-08-25 00:35:08', 6289, 'nezhalijing7@gmail.com', 'nezhalijing7', 'approved', NULL, NULL, NULL, NULL, 0),
(1252, '究極紗帽路', 'Taiwan', 'Taipei', 25.144928, 121.528398, 25.149983, 121.548123, NULL, 0, 0, 'car', 25.148738, 121.532937, 25.142712, 121.543905, '2026-08-26 14:57:44', 382, 'porsche9267@gmail.com', 'cXuN67', 'approved', NULL, NULL, NULL, NULL, 0),
(1253, '淡江大橋環狀線', 'Taiwan', 'New Taipei City', 25.180445, 121.420159, 25.160225, 121.456923, NULL, 0, 0, 'car', 25.110481, 121.424458, 25.125452, 121.457061, '2026-08-26 19:31:52', 2427, 'a29351293@gmail.com', 'a29351293', 'approved', NULL, NULL, NULL, NULL, 0),
(1254, '敦敘紗帽（上）', 'Taiwan', 'Taipei', 25.144333, 121.527114, 25.147776, 121.548647, NULL, 0, 0, 'car', 25.148284, 121.533618, 25.142985, 121.541539, '2026-08-27 09:35:56', 2427, 'a29351293@gmail.com', 'a29351293', 'approved', NULL, NULL, NULL, NULL, 0),
(1255, '直線', 'Taiwan', 'Yilan', 24.756079, 121.742818, 24.753378, 121.738983, NULL, 0, 0, 'car', 24.755096, 121.741272, 24.754099, 121.73998, '2026-08-27 10:50:44', 6212, 'a0985450054@gmail.com', 'andy0306', 'approved', NULL, NULL, NULL, NULL, 0),
(1256, '觀音山-林口段', 'Taiwan', 'New Taipei City', 25.10575, 121.40353, 25.114098, 121.402507, NULL, 0, 0, 'car', 25.107767, 121.403039, 25.112404, 121.402845, '2026-08-27 11:20:41', 6398, 'yanyuhao0314@gmail.com', 'Tuff', 'approved', NULL, NULL, NULL, NULL, 0),
(1257, '觀音山-遊客中心>民義路', 'Taiwan', 'New Taipei City', 25.12897, 121.41874, 25.114448, 121.40337, NULL, 0, 0, 'car', 25.122856, 121.414182, 25.121845, 121.409557, '2026-08-27 11:27:07', 6398, 'yanyuhao0314@gmail.com', 'Tuff', 'approved', NULL, NULL, NULL, NULL, 0),
(1258, '朝陽後山下', 'Taiwan', 'Taichung', 24.069307, 120.715556, 24.061934, 120.72543, NULL, 0, 0, 'car', 24.061896, 120.725421, 24.061896, 120.725421, '2026-08-27 13:42:26', 6302, 'john20030713@gmail.com', 'john0714', 'approved', NULL, NULL, NULL, NULL, 0),
(1259, '朝陽後山 上', 'Taiwan', 'Taichung', 24.064314, 120.7187, 24.06151, 120.725688, NULL, 0, 0, 'car', 24.063729, 120.720957, 24.063524, 120.722822, '2026-08-27 19:01:16', 6074, '102125gg@gmail.com', 'Sssaa', 'approved', NULL, NULL, NULL, NULL, 0),
(1260, '墾丁社頂', 'Taiwan', 'Pingtung', 21.949324, 120.798997, 21.956722, 120.812642, NULL, 0, 0, 'car', 21.952289, 120.807878, 21.957389, 120.810019, '2026-08-28 06:25:08', 6103, 'hwu9463@gmail.com', '0912853735', 'approved', NULL, NULL, NULL, NULL, 0),
(1261, '老龍黃大仙方向', 'Hongkong', 'Hongkong', 22.339896, 114.132559, 22.343014, 114.183462, NULL, 0, 0, 'car', 22.340169, 114.147334, 22.343369, 114.17152, '2026-08-28 15:11:12', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, NULL, NULL, NULL, 0),
(1262, '老龍明愛方向', 'Hongkong', 'Hongkong', 22.343432, 114.183569, 22.34071, 114.149775, NULL, 0, 0, 'car', 22.344045, 114.179813, 22.341053, 114.161429, '2026-08-28 15:16:06', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, NULL, NULL, NULL, 0),
(1263, '大帽山荃錦段荃灣方向', 'Hongkong', 'Hongkong', 22.405192, 114.104829, 22.392491, 114.103263, NULL, 0, 0, 'car', 22.400798, 114.107491, 22.395197, 114.103908, '2026-08-28 15:24:58', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, NULL, NULL, NULL, 0),
(1264, '大帽山荃錦段錦田方向', 'Hongkong', 'Hongkong', 22.392461, 114.104504, 22.405192, 114.104829, NULL, 0, 0, 'car', 22.395197, 114.103908, 22.400798, 114.107491, '2026-08-28 15:30:45', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, NULL, NULL, NULL, 0),
(1265, '惇敘～公園派出所', 'Taiwan', 'Chiayi', 25.144327, 121.527122, 25.148889, 121.548611, NULL, 0, 0, 'car', 25.151818, 121.532821, 25.143592, 121.53147, '2026-08-28 16:37:32', 6400, 'zx0981135438@gmail.com', 'zx0981136438', 'approved', NULL, NULL, NULL, NULL, 0),
(1266, '大埔公路沙田段', 'Hongkong', 'Hongkong', 22.370409, 114.173285, 22.347573, 114.151477, NULL, 0, 0, 'car', 22.360814, 114.161875, 22.35305, 114.156206, '2026-08-28 16:39:14', 19, 'qaz911028@gmail.com', 'Revon', 'approved', NULL, NULL, NULL, NULL, 0),
(1267, '五指風櫃嘴', 'Taiwan', 'Chiayi', 25.118495, 121.583325, 25.135673, 121.601606, NULL, 0, 0, 'car', 25.12291, 121.591898, 25.132813, 121.598127, '2026-08-28 16:52:04', 6400, 'zx0981135438@gmail.com', 'zx0981136438', 'approved', NULL, NULL, NULL, NULL, 0),
(1268, '究極紗帽路（下行）', 'Taiwan', 'Taipei', 25.149064, 121.548436, 25.145043, 121.528539, NULL, 0, 0, 'car', 25.142919, 121.543299, 25.151928, 121.532941, '2026-08-28 18:30:55', 382, 'porsche9267@gmail.com', 'cXuN67', 'approved', NULL, NULL, NULL, NULL, 0),
(1269, '虎頭山純山路', 'Taiwan', 'Taoyuan', 25.034557, 121.332627, 25.012293, 121.328479, NULL, 0, 0, 'car', 25.027559, 121.330543, 25.027559, 121.330543, '2026-08-28 20:42:45', 6070, 'suwenjie480@gmail.com', 'Sugob', 'approved', NULL, NULL, NULL, NULL, 0),
(1270, '139', 'Taiwan', 'Changhua', 24.021215, 120.598636, 24.046927, 120.588123, NULL, 0, 0, 'car', 24.032093, 120.595413, 24.042891, 120.590057, '2026-08-31 04:51:20', 6520, 'brian98981212@gmail.com', 'brian98981213', 'approved', NULL, NULL, NULL, NULL, 0),
(1273, '我是Q50沒人超越', 'Taiwan', 'Taipei', 24.737853, 120.971086, 24.315993, 120.70344, NULL, 0, 0, 'car', 24.672616, 120.894385, 24.530335, 120.826867, '2026-09-01 17:00:46', 2251, 'frank441099@gmail.com', 'frank441099@gmail.com', 'approved', NULL, NULL, NULL, NULL, 0),
(1274, '136(下)', 'Taiwan', 'Taichung', 24.085873, 120.818363, 24.107951, 120.781662, NULL, 0, 0, 'car', 24.095424, 120.812903, 24.103302, 120.797885, '2026-09-02 07:24:51', 1398, 'suya486.1116@gmail.com', 'ljt0916', 'approved', NULL, NULL, NULL, NULL, 0),
(1275, '台23往北', 'Taiwan', 'Taitung', 22.976829, 121.306798, 23.171258, 121.257693, NULL, 0, 0, 'car', 22.995302, 121.289416, 23.10378, 121.272367, '2026-09-03 13:20:12', 6614, 'weikengli@yahoo.com', 'weikengli', 'approved', NULL, NULL, NULL, NULL, 0),
(1276, '國10 自由路-燕巢', 'Taiwan', 'Kaohsiung', 22.676796, 120.322798, 22.736366, 120.361408, NULL, 0, 0, 'car', 22.677285, 120.33505, 22.722196, 120.359921, '2026-09-05 16:29:17', 6605, 's0910036469@gmail.com', 'Backlack', 'approved', NULL, NULL, NULL, NULL, 0),
(1277, '國10燕巢-榮總', 'Taiwan', 'Kaohsiung', 22.751523, 120.365304, 22.67889, 120.338099, NULL, 0, 0, 'car', 22.722376, 120.359661, 22.699546, 120.360506, '2026-09-05 16:38:36', 6605, 's0910036469@gmail.com', 'Backlack', 'approved', NULL, NULL, NULL, NULL, 0),
(1278, '田寮-旗山（越世界）', 'Taiwan', 'Kaohsiung', 22.887964, 120.396256, 22.885918, 120.465906, NULL, 0, 0, 'car', 22.892149, 120.41518, 22.887381, 120.448784, '2026-09-05 17:58:52', 6605, 's0910036469@gmail.com', 'Backlack', 'approved', NULL, NULL, NULL, NULL, 0),
(1279, '旗山-田寮（越世界）', 'Taiwan', 'Kaohsiung', 22.885955, 120.465909, 22.88037, 120.385038, NULL, 0, 0, 'car', 22.887076, 120.445737, 22.885191, 120.425405, '2026-09-05 18:03:27', 6605, 's0910036469@gmail.com', 'Backlack', 'approved', NULL, NULL, NULL, NULL, 0),
(1280, '台九茶葉蛋到頭城', 'Taiwan', 'New Taipei City', 24.860713, 121.779374, 24.857385, 121.798943, NULL, 0, 0, 'car', 24.85653, 121.790453, 24.850931, 121.789984, '2026-09-06 06:13:40', 6614, 'weikengli@yahoo.com', 'weikengli', 'approved', NULL, NULL, NULL, NULL, 0),
(1281, '試看看', 'Taiwan', 'Changhua', 23.817012, 120.717908, 23.818221, 120.705356, NULL, 0, 0, 'car', 23.811978, 120.709623, 23.815876, 120.706938, '2026-09-06 14:54:55', 6662, 'benbenben0800@gmail.com', 'a0903365263', 'approved', NULL, NULL, NULL, NULL, 0),
(1282, '埔里虎頭山-上', 'Taiwan', 'Nantou', 23.973364, 120.980117, 23.9673174, 120.9893186, NULL, 0, 0, 'car', 23.971087, 120.984407, 23.969843, 120.987417, '2026-09-07 01:06:48', 6675, 'jhjg256@yahoo.com', 'jhjg256', 'approved', NULL, NULL, NULL, NULL, 0),
(1283, '三義-薑麻園', 'Taiwan', 'Miaoli', 24.404373, 120.790693, 24.38577, 120.821463, NULL, 0, 0, 'car', 24.392018, 120.794682, 24.382913, 120.807456, '2026-09-07 03:36:02', 5528, 'aa0938900069@gmail.com', 'Jun0087', 'approved', NULL, NULL, NULL, NULL, 0),
(1284, '深南路', 'Taiwan', 'New Taipei City', 25.018346, 121.6236, 25.030736, 121.621372, NULL, 0, 0, 'car', 25.023329, 121.624502, 25.027773, 121.62269, '2026-09-07 09:41:25', 6693, 'aa0903695179@gmail.com', 'Zya223522', 'approved', NULL, NULL, NULL, NULL, 0),
(1285, '究極小坪頂', 'Taiwan', 'Taipei', 25.181812, 121.485428, 25.143458, 121.488845, NULL, 0, 0, 'car', 25.171058, 121.485423, 25.157425, 121.484559, '2026-09-07 19:30:24', 382, 'porsche9267@gmail.com', 'cXuN67', 'approved', NULL, NULL, NULL, NULL, 0),
(1286, '竹崎瑞里', 'Taiwan', 'Chiayi', 23.518037, 120.593587, 23.537549, 120.67973, NULL, 0, 0, 'car', 23.518952, 120.595516, 23.536425, 120.630971, '2026-09-08 16:45:19', 6736, '109095@msjh.cyc.edu.tw', '109095@msjh.cyc.edu.tw', 'approved', NULL, NULL, NULL, NULL, 0),
(1287, '阿婆雜貨店-川興測速前', 'Taiwan', 'Chiayi', 23.361873, 120.580564, 23.356905, 120.590136, NULL, 0, 0, 'car', 23.360383, 120.584035, 23.358363, 120.586904, '2026-09-10 09:17:36', 2336, 'sgh00427@gmail.com', 'sgh00427@gmail.com', 'pending', NULL, NULL, NULL, NULL, 0),
(1288, '川興下大灣-阿婆雜貨店', 'Taiwan', 'Chiayi', 23.361107, 120.592956, 23.361813, 120.580561, NULL, 0, 0, 'car', 23.356944, 120.590859, 23.36027, 120.584187, '2026-09-10 09:20:14', 2336, 'sgh00427@gmail.com', 'sgh00427@gmail.com', 'pending', NULL, NULL, NULL, NULL, 0),
(1289, '瑞井派接永春南路', 'Taiwan', 'Taichung', 24.152157, 120.573537, 24.141437, 120.583178, NULL, 0, 0, 'car', 24.146718, 120.575837, 24.143356, 120.581352, '2026-09-10 10:20:30', 4761, 'abcben26760776@gmail.com', 'abcben26760776', 'pending', NULL, NULL, NULL, NULL, 0),
(1290, '彰化到埔里', 'Taiwan', 'Taichung', 24.099077, 120.578742, 23.966306, 120.945879, NULL, 0, 0, 'car', 24.023258, 120.826055, 24.000392, 120.847468, '2026-09-10 17:49:49', 4761, 'abcben26760776@gmail.com', 'abcben26760776', 'pending', NULL, NULL, NULL, NULL, 0);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `custom_tracks`
--
ALTER TABLE `custom_tracks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_country_city` (`country`,`city`),
  ADD KEY `idx_creator` (`creator_id`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `idx_hidden` (`is_hidden`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `custom_tracks`
--
ALTER TABLE `custom_tracks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1291;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
